docs/other_layouts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Other Layouts</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Other Layouts</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgefde5d1">Rolll</a></li>
<li><a href="#org442b650">Hyperroll</a></li>
<li><a href="#org7a7212c">Flaw</a></li>
<li><a href="#orgbc491f0">Less serious layouts</a>
<ul>
<li><a href="#orge0b02f7">Foalmak</a></li>
<li><a href="#org0eae8a3">Vitrimak</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I've made some other layouts besides <a href="./semimak/index.html">Semimak</a>. Some of them are pretty
neat, but they haven't been very public besides floating around
Discord. Mostly, the great ec0vid wanted to have an official reference
for the <a href="https://bit.ly/keyboard-layouts-doc">Keyboard Layouts Doc</a>, so here's that.
</p>
<div id="outline-container-orgefde5d1" class="outline-2">
<h2 id="orgefde5d1">Rolll</h2>
<div class="outline-text-2" id="text-orgefde5d1">
<pre class="example">
y o u w b  x k c l v
i a e n p  d h s r t
j / , . q  f m g ' z
</pre>
<p>
I made Rolll after Semimak. It's called Rolll because it's basically
Semimak but it has more rolls, particularly inward rolls. It also
has less redirects. There's not much more to it other than that. If
you mirror the layout, it's pretty similar to Semimak. The main
possible issue for people would be the <code>vtz</code> right pinky. And of
course, some of the same problems as Semimak, like the <code>lr'</code> ring
and the <code>e,</code> SFB.
</p>

<p>
In terms of how good it is overall, it's better than Semimak in
terms of the relationships between different fingers; the
roll/redirect ratio is quite good. It utilizes the index fingers
more, which most people would probably like. However, it does have
worse same-finger statistics than Semimak.
</p>
</div>
</div>
<div id="outline-container-org442b650" class="outline-2">
<h2 id="org442b650">Hyperroll</h2>
<div class="outline-text-2" id="text-org442b650">
<pre class="example">
p c l m v  x u o y f
n s r t d  . a e i h
b g ' w z  / , q j k
</pre>
<p>
Like Rolll, this one has a lot of rolls, except it has very few
outward rolls and redirects. Hyperroll actually looks pretty nice
overall, but the pinky movement might be a bit much for most people.
</p>
</div>
</div>
<div id="outline-container-org7a7212c" class="outline-2">
<h2 id="org7a7212c">Flaw</h2>
<div class="outline-text-2" id="text-org7a7212c">
<pre class="example">
f l a w p  z k u r /
h s o y c  m t e n i
b j ' g v  q d . x ,
</pre>
<p>
Flaw is just a layout I stumbled across while making Semimak. It's
funny because it says "flaw" on the top. That's pretty much where
the interesting stuff about it ends.
</p>
</div>
</div>
<div id="outline-container-orgbc491f0" class="outline-2">
<h2 id="orgbc491f0">Less serious layouts</h2>
<div class="outline-text-2" id="text-orgbc491f0">
</div>
<div id="outline-container-orge0b02f7" class="outline-3">
<h3 id="orge0b02f7">Foalmak</h3>
<div class="outline-text-3" id="text-orge0b02f7">
<pre class="example">
b x , w v  z / u t k
f o a l s  n e i g h
p ' . m c  q j y d r 
</pre>
<p>
I made Foalmak for the Colemak Discord's "April's Foal" day
in 2021. It says "foals neigh" on the homerow. Pretty funny. It's
even in <a href="https://github.com/DreymaR/BigBagKbdTrixPKL/tree/master/Layouts/Foalmak">EPKL</a>.
</p>
</div>
</div>
<div id="outline-container-org0eae8a3" class="outline-3">
<h3 id="org0eae8a3">Vitrimak</h3>
<div class="outline-text-3" id="text-org0eae8a3">
<p>
Staggered
</p>
<pre class="example">
t k v u m  i a j b r
 w x / f p  d g q , s
  h . ' c o  l n z y e 
</pre>

<p>
Ortho
</p>
<pre class="example">
t y q o c  a i v . e
w , x p m  g d / j s
h b z u f  n l ' k r
</pre>

<p>
Vitrimak is an attempt at making the "worst" keyboard layout,
similar to CarpalX's TNWMLC layout. It only used finger speed as a
metric. It's not bad at being bad.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
